# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics RT-DETR with MobileNetV4 Hybrid Medium backbone
# Model docs: https://docs.ultralytics.com/models/rtdetr
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  m: [1.00, 1.00, 512]

backbone:
  # MobileNetV4 Hybrid Medium backbone inspired architecture
  # Stage 0 - Stem: input 640x640 -> 320x320
  - [-1, 1, Conv, [32, 3, 2]]  # 0-P1/2, stem conv

  # Stage 1 - 320x320 -> 160x160  
  - [-1, 1, EdgeResidual, [48, 2, 4]]  # 1-P2/4, FusedIB (EdgeResidual) 

  # Stage 2 - 160x160 -> 80x80
  - [-1, 1, UniversalInvertedResidual, [80, 2, 4, 5]]  # 2-P3/8, ExtraDW with k=5
  - [-1, 1, UniversalInvertedResidual, [80, 1, 2, 3]]  # 3, ExtraDW with k=3

  # Stage 3 - 80x80 -> 40x40 (重要的特征层)
  - [-1, 1, UniversalInvertedResidual, [160, 2, 6, 5]]  # 4-P4/16, ExtraDW with k=5
  - [-1, 1, UniversalInvertedResidual, [160, 1, 2, 3]]  # 5, FFN-like
  - [-1, 1, UniversalInvertedResidual, [160, 1, 4, 3]]  # 6, ExtraDW
  - [-1, 1, UniversalInvertedResidual, [160, 1, 4, 5]]  # 7, ExtraDW
  - [-1, 1, C2f, [160]]                                 # 8, MQA-like attention
  - [-1, 1, UniversalInvertedResidual, [160, 1, 4, 3]]  # 9, ExtraDW
  - [-1, 1, C2f, [160]]                                 # 10, MQA-like attention
  - [-1, 1, UniversalInvertedResidual, [160, 1, 4, 3]]  # 11, ConvNeXt-like
  - [-1, 1, C2f, [160]]                                 # 12, MQA-like attention

  # Stage 4 - 40x40 -> 20x20 (重要的特征层)
  - [-1, 1, UniversalInvertedResidual, [256, 2, 6, 5]]  # 13-P5/32, ExtraDW with k=5
  - [-1, 1, UniversalInvertedResidual, [256, 1, 4, 5]]  # 14, ExtraDW
  - [-1, 2, UniversalInvertedResidual, [256, 1, 4, 5]]  # 15, ExtraDW blocks
  - [-1, 1, UniversalInvertedResidual, [256, 1, 2, 3]]  # 16, FFN-like
  - [-1, 1, UniversalInvertedResidual, [256, 1, 2, 5]]  # 17, ExtraDW
  - [-1, 1, UniversalInvertedResidual, [256, 1, 2, 3]]  # 18, FFN-like
  - [-1, 1, UniversalInvertedResidual, [256, 1, 4, 3]]  # 19, FFN-like
  - [-1, 1, C2f, [256]]                                 # 20, MQA attention
  - [-1, 1, UniversalInvertedResidual, [256, 1, 4, 3]]  # 21, ConvNeXt-like

  # Final conv layer
  - [-1, 1, Conv, [960, 1, 1]]  # 22, final conv (matches MobileNetV4)

head:
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 23 input_proj.2
  - [-1, 1, AIFI, [1024, 8]]
  - [-1, 1, Conv, [256, 1, 1]] # 25, Y5, lateral_convs.0

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [12, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 27 input_proj.1 (from stage 3)
  - [[-2, -1], 1, Concat, [1]]
  - [-1, 3, RepC3, [256]] # 29, fpn_blocks.0
  - [-1, 1, Conv, [256, 1, 1]] # 30, Y4, lateral_convs.1

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [3, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 32 input_proj.0 (from stage 2)
  - [[-2, -1], 1, Concat, [1]] # cat backbone P4
  - [-1, 3, RepC3, [256]] # X3 (34), fpn_blocks.1

  - [-1, 1, Conv, [256, 3, 2]] # 35, downsample_convs.0
  - [[-1, 30], 1, Concat, [1]] # cat Y4
  - [-1, 3, RepC3, [256]] # F4 (37), pan_blocks.0

  - [-1, 1, Conv, [256, 3, 2]] # 38, downsample_convs.1
  - [[-1, 25], 1, Concat, [1]] # cat Y5
  - [-1, 3, RepC3, [256]] # F5 (40), pan_blocks.1

  - [[34, 37, 40], 1, RTDETRDecoder, [nc]] # Detect(P3, P4, P5)
