# Ultralytics RT-DETR with Stable MobileNetV4 Architecture
# 稳定的MobileNetV4架构，使用验证过的标准模块
# Model docs: https://docs.ultralytics.com/models/rtdetr

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  m: [1.00, 1.00, 512]

backbone:
  # Stable MobileNetV4-inspired Architecture
  # 使用经过验证的标准模块实现MobileNetV4核心特性
  
  # Stage 0 - Stem
  - [-1, 1, Conv, [32, 3, 2]]        # 0-P1/2, stem conv
  - [-1, 1, Conv, [32, 3, 1]]        # 1, stem conv2

  # Stage 1 - Early Features  
  - [-1, 1, Conv, [64, 3, 2]]        # 2-P2/4, downsampling
  - [-1, 1, GhostBottleneck, [64]]   # 3, efficient block
  - [-1, 1, Conv, [64, 1, 1]]        # 4, pointwise

  # Stage 2 - Inverted Residual Stage
  - [-1, 1, Conv, [96, 3, 2]]        # 5-P3/8, downsampling
  - [-1, 2, C2f, [96]]               # 6, efficient blocks
  - [-1, 1, GhostBottleneck, [96]]   # 7, ghost bottleneck

  # Stage 3 - Multi-Scale Features (重要特征层)
  - [-1, 1, Conv, [192, 3, 2]]       # 8-P4/16, downsampling
  - [-1, 3, C2f, [192]]              # 9, multiple blocks
  - [-1, 1, SPPF, [192, 5]]          # 10, spatial pyramid
  - [-1, 1, GhostBottleneck, [192]]  # 11, efficient expansion

  # Stage 4 - High-Level Features (重要特征层)
  - [-1, 1, Conv, [384, 3, 2]]       # 12-P5/32, downsampling
  - [-1, 3, C2f, [384]]              # 13, processing blocks
  - [-1, 1, SPPF, [384, 3]]          # 14, multi-scale pooling
  - [-1, 1, GhostBottleneck, [384]]  # 15, final expansion

  # Final Feature Layer
  - [-1, 1, Conv, [512, 1, 1]]       # 16, final features

head:
  # Standard RT-DETR Head
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 17 input_proj.2
  - [-1, 1, AIFI, [1024, 8]]                      # 18 transformer
  - [-1, 1, Conv, [256, 1, 1]]                    # 19, Y5, lateral_convs.0

  # FPN
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [11, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 21 input_proj.1
  - [[-2, -1], 1, Concat, [1]]
  - [-1, 3, RepC3, [256]]                         # 23, fpn_blocks.0
  - [-1, 1, Conv, [256, 1, 1]]                    # 24, Y4, lateral_convs.1

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [7, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 26 input_proj.0
  - [[-2, -1], 1, Concat, [1]]                    # cat backbone features
  - [-1, 3, RepC3, [256]]                         # X3 (28), fpn_blocks.1

  # PAN
  - [-1, 1, Conv, [256, 3, 2]]                    # 29, downsample_convs.0
  - [[-1, 24], 1, Concat, [1]]                    # cat Y4
  - [-1, 3, RepC3, [256]]                         # F4 (31), pan_blocks.0

  - [-1, 1, Conv, [256, 3, 2]]                    # 32, downsample_convs.1
  - [[-1, 19], 1, Concat, [1]]                    # cat Y5
  - [-1, 3, RepC3, [256]]                         # F5 (34), pan_blocks.1

  # Detection Head
  - [[28, 31, 34], 1, RTDETRDecoder, [nc]]        # Detect(P3, P4, P5)
